public class Bitwise {
    public static void main(String[] args) {
//        int x =1;
//        int y =2;
//        System.out.println(x^y);


//          int x=8;//实现不通过第三个变量将两个值做交换。
//          int y=5;
//          x=x^y;//x=13
//          y=y^x;//y=8
//          x=x^y;//x=5
//        System.out.println(x+"\t"+y);

//            int x=10;
//            int y=5;
//            int max=x>y?x:y;
//        System.out.println(max);


    }
}
//位运算，把数转换成二进制。
//按位与运算：两边同时位为一才是1.
//按位或运算：两边有一边结果为1才是1.
//按位异或运算：使用^符号，两边相同，则为零，不同则为1.
//按位取反符号是~。得到补码，减一再取反，得到原码。
//左移位运算：正负不变。用符号<<表示，整体将二进制向左移动1位，右侧补0，左移动一位，相当于×2处理。
//右移位运算：左侧补零，用符号>>表示，除以2.
//如果移动的位数超过所能表述的长度，则用求余运算。
//无符号移位，用>>>表示，不考虑正负数的问题。正数移动和右移位相同。

//三元运算符
//x?y:z  x必须是boolean类型的值，如果x为true，则整个表达式取值为y，否则为z

//优先级
